VPro/src/Documents/LoanInterestCommissionAccruals/LoanInterestCommissionAccruals.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>LoanInterestCommissionAccruals</name>
  <registerRecords>AccountingRegister.Managerial</registerRecords>
  <registerRecords>AccumulationRegister.Inventory</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpenses</registerRecords>
  <registerRecords>AccumulationRegister.LoanSettlements</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>OperationType</name>
    <type>
      <types>EnumRef.LoanAccrualTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>StartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Accruals</name>
    <attributes>
      <name>AmountType</name>
      <type>
        <types>EnumRef.LoanScheduleAmountTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Lender</name>
      <type>
        <types>CatalogRef.Counterparties</types>
      </type>
    </attributes>
    <attributes>
      <name>LoanContract</name>
      <type>
        <types>DocumentRef.LoanContract</types>
      </type>
    </attributes>
    <attributes>
      <name>SettlementsCurrency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

VPro/src/Enums/LoanScheduleAmountTypes/LoanScheduleAmountTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>LoanScheduleAmountTypes</name>
  <enumValues>
    <name>Principal</name>
  </enumValues>
  <enumValues>
    <name>Interest</name>
  </enumValues>
  <enumValues>
    <name>Commission</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Enums/LoanAccrualTypes/LoanAccrualTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>LoanAccrualTypes</name>
  <enumValues>
    <name>AccrualsForEmployeeLoans</name>
  </enumValues>
  <enumValues>
    <name>AccrualsForLoansBorrowed</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Documents/LoanInterestCommissionAccruals/Forms/FormOfEnteringCashFundExpense/Module.bsl
#Region GeneralPurposeProceduresAndFunctions

// Procedure fills in the contract table with data from the Document accruals LoanInterestCommissionAccruals TS.
//
&AtServer
Procedure FillInContractTable()
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	AccrualsForLoansAccruals.Employee,
	|	AccrualsForLoansAccruals.Lender,
	|	AccrualsForLoansAccruals.LoanContract,
	|	AccrualsForLoansAccruals.SettlementsCurrency,
	|	SUM(CASE
	|			WHEN AccrualsForLoansAccruals.AmountType = &AmountTypeInterest
	|				THEN AccrualsForLoansAccruals.Total
	|			ELSE 0
	|		END) AS Interest,
	|	SUM(CASE
	|			WHEN AccrualsForLoansAccruals.AmountType = &AmountTypeInterest
	|				THEN 0
	|			ELSE AccrualsForLoansAccruals.Total
	|		END) AS Commission,
	|	TRUE AS Mark
	|FROM
	|	Document.LoanInterestCommissionAccruals.Accruals AS AccrualsForLoansAccruals
	|WHERE
	|	AccrualsForLoansAccruals.Ref = &DocumentAccruals
	|
	|GROUP BY
	|	AccrualsForLoansAccruals.LoanContract,
	|	AccrualsForLoansAccruals.SettlementsCurrency,
	|	AccrualsForLoansAccruals.Lender,
	|	AccrualsForLoansAccruals.Employee";
	
	Query.SetParameter("DocumentAccruals",		DocumentAccruals);
	Query.SetParameter("AmountTypeInterest",	Enums.LoanScheduleAmountTypes.Interest);
	
	RequestResult = Query.Execute();
	
	ContractsOfLoan.Load(RequestResult.Unload());
	
EndProcedure

#EndRegion

#Region ProceduresEventHandlersForms

// Procedure - handler of the WhenCreatingOnServer event of the form.
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	DocumentAccruals = Parameters.DocumentAccruals;
	If Not ValueIsFilled(DocumentAccruals) Then
		Cancel = True;
		Return;
	EndIf;
	
	If DocumentAccruals.OperationType = Enums.LoanAccrualTypes.AccrualsForLoansBorrowed Then
		
		Items.GroupCashExpenseButtons.Visible			= True;
		Items.FormEnterExpenseFromAccount.DefaultButton	= True;
		
		Items.GroupCashReceiptButtons.Visible			= False;
		Items.FormEnterReceiptToCashFund.DefaultButton	= False;
		
	Else
		
		Items.GroupCashExpenseButtons.Visible			= False;
		Items.FormEnterExpenseFromAccount.DefaultButton = False;
		
		Items.GroupCashReceiptButtons.Visible			= True;
		Items.FormEnterReceiptToCashFund.DefaultButton	= True;
	EndIf;
	
	FillInContractTable();
	
EndProcedure

#EndRegion

#Region CommandActionProcedures

// Procedure - handler of the EnterActualPayment command.
//
&AtClient
Procedure EnterActualPayment(DocumentKind)
	
	IsMark = False;
	
	For Each CurrentRow In ContractsOfLoan Do
		If CurrentRow.Mark Then
			IsMark = True;
			
			ParametersOfLoans = New Structure("Document, LoanContract, SettlementsCurrency, Employee, Lender", 
				DocumentAccruals, 
				CurrentRow.LoanContract,
				CurrentRow.SettlementsCurrency,
				CurrentRow.Employee,
				CurrentRow.Lender
			);
			FillingParameters = New Structure("Basis", ParametersOfLoans);
			
			OpenForm("Document." + DocumentKind + ".ObjectForm", FillingParameters, , CurrentRow.LoanContract);
		EndIf;
	EndDo;
	
	If Not IsMark Then
		ShowMessageBox(Undefined, 
			NStr("en='No line selected. Mark check boxes and try again.';ru='Строка не выбрана. Выставите флаг в первой колоке и попробуйте снова';vi='Chưa chọn dòng. Hãy đặt dấu hộp kiểm trong cột đầu tiên và thử lại.'"));
	EndIf;
	
EndProcedure

// Procedure - handler of the EnterCashFundExpense command.
//
&AtClient
Procedure EnterCashFundExpense(Command)
	
	EnterActualPayment("CashPayment");
	Close();
	
EndProcedure

// Procedure - handler of the EnterCashFundReceipt command.
//
&AtClient
Procedure EnterCashFundReceipt(Command)
	
	EnterActualPayment("CashReceipt");
	Close();
	
EndProcedure

// Procedure - handler of the EnterExpenseFromAccount command.
//
&AtClient
Procedure EnterExpenseFromAccount(Command)
	
	EnterActualPayment("PaymentExpense");
	Close();
	
EndProcedure

// Procedure - handler of the ReceiptToAccount command.
//
&AtClient
Procedure EnterReceiptToAccount(Command)
	
	EnterActualPayment("PaymentReceipt");
	Close();
	
EndProcedure

#EndRegion
